# (4). 정렬, Aggregation, Group By, 결손


## 1. sort_values() - 정렬

DataFrame.sort_values(by=['columns'],ascending=T/F,implace=T/F)

* by: SQL의 order by와 비슷. 입력한 칼럼으로 정렬함.
* ascending: False면 내림차순. 기본은 True 오름차순
* inplace: 기본은 False. True시 반환값없고 호출한 DF에 결과 적용

In [1]:
import pandas as pd

titanic_df = pd.read_csv(r'../data/titanic_train.csv')

sorted_df = titanic_df.sort_values(by=['Name'])
sorted_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.55,NaN,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.25,NaN,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.25,NaN,S

여러 개의 칼럼을 정렬할 시 by에 리스트 형식으로 칼럼을 입력하면 된다.

In [2]:
sorted_df = titanic_df.sort_values(by=['Pclass','Name'],ascending=False)
sorted_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5,NaN,S
282,283,0,3,"de Pelsmaeker, Mr. Alfons",male,16.0,0,0,345778,9.5,NaN,S

## 2. Aggregation

min(), max(), sum(), count() 등을 DataFrame에 바로 호출할 경우, 모든 칼럼에 대해서 적용한다.

In [3]:
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

#### 참고용 describe 표

In [4]:
titanic_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### 2-1. 특정 칼럼에만 적용하기
---
대상 칼럼을 추출한 후 aggregation 적용

In [5]:
titanic_df[['Age','Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

## 3. groupby() (★)

기능은 SQL의 group by와 유사하지만 다른 면이 있음. 마찬가지로 분석에 자주 쓰인다.

DataFrame에 groupby()를 호출하면 DataFrameGroupBy라는 또다른 형태의 DataFrame을 반환한다.

In [6]:
groupby_df = titanic_df.groupby(by='Pclass')
print(type(groupby_df))

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>

### 3-1. SQL과의 차이점
---

#### 1.  DataFrame.groupby() 결과에 aggregation 함수를 호출하면 groupby() 대상 칼럼을 제외한 모든 칼럼에 해당 aggregation을 적용한다.

In [7]:
groupby_df = titanic_df.groupby(by='Pclass').count()
groupby_df

,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
Pclass,,,,,,,,,,,
1,216,216,216,216,186,216,216,216,216,176,214
2,184,184,184,184,173,184,184,184,184,16,184
3,491,491,491,491,355,491,491,491,491,12,491

이 상태에서 특정 칼럼에만 aggregation을 수행하려면 DFGB 객체에서 원하는 칼럼을 필터링해와 수행한다.

In [8]:
groupby_df = titanic_df.groupby('Pclass')[['PassengerId','Survived']].count()
groupby_df

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

#### 2. 칼럼마다 서로 다른 aggregation 함수를 적용할 경우
* SQL: Select절에 max(Age), min(Age) ... 직접 나열하면 됨
* DataFrame: agg()내에 인자로 입력한다.

In [9]:
titanic_df.groupby('Pclass')['Age'].agg([max,min])

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42

DataFrame은 groupby()를 이용해 API기반으로 처리하므로 SQL보다 유연성이 떨어지는 편이다.

여러 개의 칼럼마다 다른 aggregation을 쓰는 경우 SQL이 더 쉽게 사용 가능.

DataFrame에서는 agg()내에 입력값으로 딕셔너리 형태로 칼럼과 적용함수를 입력해야한다.

In [10]:
agg_format={'Age':'max','SibSp':'sum','Fare':'mean'}
titanic_df.groupby('Pclass').agg(agg_format)

         Age  SibSp       Fare
Pclass
1       80.0     90  84.154687
2       70.0     74  20.662183
3       74.0    302  13.675550

## 4. 결손 데이터 처리하기

* 결손 데이터란? : 칼럼에 값이 없는, 즉 NULL인 경우. numpy에서는 NaN

머신러닝 알고리즘은 NaN 값을 처리하지 않기에 다른 값으로 대체해야한다.또한 NaN 값은 평균, 총합 등 연산 시에 제외된다.

### 4-1. isna() - 결손 데이터 여부 확인
---

In [11]:
titanic_df.isna().head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,True,False

#### 결손 데이터 개수 - isna().sum()

In [12]:
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### 4-2. fillna() - 결손 데이터 대체하기
---
fillna() 반환값을 다시 받거나 inplace=True 파라미터를 추가해야 실제 데이터셋에 반영된다.

In [13]:
titanic_df['Cabin'] = titanic_df['Cabin'].fillna('C000')
titanic_df['Cabin'].head()

0    C000
1     C85
2    C000
3    C123
4    C000
Name: Cabin, dtype: object

In [14]:
titanic_df['Cabin'].fillna('C000',inplace=True)
titanic_df['Cabin'].head()

0    C000
1     C85
2    C000
3    C123
4    C000
Name: Cabin, dtype: object

#### 결손 데이터 처리하기
Age: 평균 나이, Embarked: S 로 NaN값 대체하기

In [15]:
titanic_df['Age'].fillna(titanic_df['Age'].mean(),inplace=True)
titanic_df['Embarked'].fillna('S',inplace=True)
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64